#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/philward_io/philward_io/runs/run-hYjrbaswhkhZYrGZ

Waiting for the plan to start...

Terraform v1.2.8
on linux_amd64
Initializing plugins and modules...
aws_cloudfront_origin_access_identity.resume_oai: Refreshing state... [id=E1AVBUZT0CBMF6]
aws_route53_zone.philward_io_zone: Refreshing state... [id=Z003529526RCV8G5J1PS7]
data.aws_cloudfront_cache_policy.resume_distribution_cache_policy: Reading...
aws_s3_bucket.resume_bucket: Refreshing state... [id=resume.philward.io]
data.aws_cloudfront_cache_policy.resume_distribution_cache_policy: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
aws_route53domains_registered_domain.philward_io_domain: Refreshing state... [id=philward.io]
data.aws_iam_policy_document.resume_bucket_policy_document: Reading...
data.aws_iam_policy_document.resume_bucket_policy_document: Read complete after 0s [id=3877817331]
aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E5CPX462LFNKX]
aws_s3_object.resume_bucket_contents["assets/img/favicon.png"]: Refreshing state... [id=assets/img/favicon.png]
aws_s3_bucket_policy.resume_bucket_policy: Refreshing state... [id=resume.philward.io]
aws_s3_object.resume_bucket_contents["css/styles.css"]: Refreshing state... [id=css/styles.css]
aws_s3_object.resume_bucket_contents["index.html"]: Refreshing state... [id=index.html]
aws_s3_object.resume_bucket_contents["js/scripts.js"]: Refreshing state... [id=js/scripts.js]
aws_s3_object.resume_bucket_contents["assets/img/profile.png"]: Refreshing state... [id=assets/img/profile.png]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_route53domains_registered_domain.philward_io_domain will be destroyed
  # (because resource uses count or for_each)
  - resource "aws_route53domains_registered_domain" "philward_io_domain" {
      - abuse_contact_email = "abuse@support.gandi.net" -> null
      - abuse_contact_phone = "+33.170377661" -> null
      - admin_privacy       = true -> null
      - auto_renew          = true -> null
      - creation_date       = "2021-04-13T10:00:37Z" -> null
      - domain_name         = "philward.io" -> null
      - expiration_date     = "2023-04-13T10:00:37Z" -> null
      - id                  = "philward.io" -> null
      - registrant_privacy  = true -> null
      - registrar_name      = "GANDI SAS" -> null
      - registrar_url       = "http://www.gandi.net" -> null
      - status_list         = [
          - "clientTransferProhibited",
        ] -> null
      - tags                = {} -> null
      - tags_all            = {} -> null
      - tech_privacy        = true -> null
      - transfer_lock       = true -> null
      - updated_date        = "2022-03-10T06:58:45Z" -> null
      - whois_server        = "whois.gandi.net" -> null

      - admin_contact {
          - address_line_1 = "Franzengatan 40" -> null
          - city           = "Stockholm" -> null
          - contact_type   = "PERSON" -> null
          - country_code   = "SE" -> null
          - email          = "ward.phil@gmail.com" -> null
          - extra_params   = {} -> null
          - first_name     = "Phil" -> null
          - last_name      = "Ward" -> null
          - phone_number   = "+1.3196212188" -> null
          - zip_code       = "112 16" -> null
        }

      - name_server {
          - glue_ips = [] -> null
          - name     = "ns-1877.awsdns-42.co.uk" -> null
        }
      - name_server {
          - glue_ips = [] -> null
          - name     = "ns-852.awsdns-42.net" -> null
        }
      - name_server {
          - glue_ips = [] -> null
          - name     = "ns-85.awsdns-10.com" -> null
        }
      - name_server {
          - glue_ips = [] -> null
          - name     = "ns-1493.awsdns-58.org" -> null
        }

      - registrant_contact {
          - address_line_1 = "Franzengatan 40" -> null
          - city           = "Stockholm" -> null
          - contact_type   = "PERSON" -> null
          - country_code   = "SE" -> null
          - email          = "ward.phil@gmail.com" -> null
          - extra_params   = {} -> null
          - first_name     = "Phil" -> null
          - last_name      = "Ward" -> null
          - phone_number   = "+1.3196212188" -> null
          - zip_code       = "112 16" -> null
        }

      - tech_contact {
          - address_line_1 = "Franzengatan 40" -> null
          - city           = "Stockholm" -> null
          - contact_type   = "PERSON" -> null
          - country_code   = "SE" -> null
          - email          = "ward.phil@gmail.com" -> null
          - extra_params   = {} -> null
          - first_name     = "Phil" -> null
          - last_name      = "Ward" -> null
          - phone_number   = "+1.3196212188" -> null
          - zip_code       = "112 16" -> null
        }
    }

  # aws_route53domains_registered_domain.philward_io_domain["ns-1174.awsdns-18.org"] will be created
  + resource "aws_route53domains_registered_domain" "philward_io_domain" {
      + abuse_contact_email = (known after apply)
      + abuse_contact_phone = (known after apply)
      + admin_privacy       = true
      + auto_renew          = true
      + creation_date       = (known after apply)
      + domain_name         = "philward.io"
      + expiration_date     = (known after apply)
      + id                  = (known after apply)
      + registrant_privacy  = true
      + registrar_name      = (known after apply)
      + registrar_url       = (known after apply)
      + reseller            = (known after apply)
      + status_list         = (known after apply)
      + tags_all            = (known after apply)
      + tech_privacy        = true
      + transfer_lock       = true
      + updated_date        = (known after apply)
      + whois_server        = (known after apply)

      + admin_contact {
          + address_line_1    = (known after apply)
          + address_line_2    = (known after apply)
          + city              = (known after apply)
          + contact_type      = (known after apply)
          + country_code      = (known after apply)
          + email             = (known after apply)
          + extra_params      = (known after apply)
          + fax               = (known after apply)
          + first_name        = (known after apply)
          + last_name         = (known after apply)
          + organization_name = (known after apply)
          + phone_number      = (known after apply)
          + state             = (known after apply)
          + zip_code          = (known after apply)
        }

      + name_server {
          + name = "ns-1174.awsdns-18.org"
        }

      + registrant_contact {
          + address_line_1    = (known after apply)
          + address_line_2    = (known after apply)
          + city              = (known after apply)
          + contact_type      = (known after apply)
          + country_code      = (known after apply)
          + email             = (known after apply)
          + extra_params      = (known after apply)
          + fax               = (known after apply)
          + first_name        = (known after apply)
          + last_name         = (known after apply)
          + organization_name = (known after apply)
          + phone_number      = (known after apply)
          + state             = (known after apply)
          + zip_code          = (known after apply)
        }

      + tech_contact {
          + address_line_1    = (known after apply)
          + address_line_2    = (known after apply)
          + city              = (known after apply)
          + contact_type      = (known after apply)
          + country_code      = (known after apply)
          + email             = (known after apply)
          + extra_params      = (known after apply)
          + fax               = (known after apply)
          + first_name        = (known after apply)
          + last_name         = (known after apply)
          + organization_name = (known after apply)
          + phone_number      = (known after apply)
          + state             = (known after apply)
          + zip_code          = (known after apply)
        }
    }

  # aws_route53domains_registered_domain.philward_io_domain["ns-1638.awsdns-12.co.uk"] will be created
  + resource "aws_route53domains_registered_domain" "philward_io_domain" {
      + abuse_contact_email = (known after apply)
      + abuse_contact_phone = (known after apply)
      + admin_privacy       = true
      + auto_renew          = true
      + creation_date       = (known after apply)
      + domain_name         = "philward.io"
      + expiration_date     = (known after apply)
      + id                  = (known after apply)
      + registrant_privacy  = true
      + registrar_name      = (known after apply)
      + registrar_url       = (known after apply)
      + reseller            = (known after apply)
      + status_list         = (known after apply)
      + tags_all            = (known after apply)
      + tech_privacy        = true
      + transfer_lock       = true
      + updated_date        = (known after apply)
      + whois_server        = (known after apply)

      + admin_contact {
          + address_line_1    = (known after apply)
          + address_line_2    = (known after apply)
          + city              = (known after apply)
          + contact_type      = (known after apply)
          + country_code      = (known after apply)
          + email             = (known after apply)
          + extra_params      = (known after apply)
          + fax               = (known after apply)
          + first_name        = (known after apply)
          + last_name         = (known after apply)
          + organization_name = (known after apply)
          + phone_number      = (known after apply)
          + state             = (known after apply)
          + zip_code          = (known after apply)
        }

      + name_server {
          + name = "ns-1638.awsdns-12.co.uk"
        }

      + registrant_contact {
          + address_line_1    = (known after apply)
          + address_line_2    = (known after apply)
          + city              = (known after apply)
          + contact_type      = (known after apply)
          + country_code      = (known after apply)
          + email             = (known after apply)
          + extra_params      = (known after apply)
          + fax               = (known after apply)
          + first_name        = (known after apply)
          + last_name         = (known after apply)
          + organization_name = (known after apply)
          + phone_number      = (known after apply)
          + state             = (known after apply)
          + zip_code          = (known after apply)
        }

      + tech_contact {
          + address_line_1    = (known after apply)
          + address_line_2    = (known after apply)
          + city              = (known after apply)
          + contact_type      = (known after apply)
          + country_code      = (known after apply)
          + email             = (known after apply)
          + extra_params      = (known after apply)
          + fax               = (known after apply)
          + first_name        = (known after apply)
          + last_name         = (known after apply)
          + organization_name = (known after apply)
          + phone_number      = (known after apply)
          + state             = (known after apply)
          + zip_code          = (known after apply)
        }
    }

  # aws_route53domains_registered_domain.philward_io_domain["ns-351.awsdns-43.com"] will be created
  + resource "aws_route53domains_registered_domain" "philward_io_domain" {
      + abuse_contact_email = (known after apply)
      + abuse_contact_phone = (known after apply)
      + admin_privacy       = true
      + auto_renew          = true
      + creation_date       = (known after apply)
      + domain_name         = "philward.io"
      + expiration_date     = (known after apply)
      + id                  = (known after apply)
      + registrant_privacy  = true
      + registrar_name      = (known after apply)
      + registrar_url       = (known after apply)
      + reseller            = (known after apply)
      + status_list         = (known after apply)
      + tags_all            = (known after apply)
      + tech_privacy        = true
      + transfer_lock       = true
      + updated_date        = (known after apply)
      + whois_server        = (known after apply)

      + admin_contact {
          + address_line_1    = (known after apply)
          + address_line_2    = (known after apply)
          + city              = (known after apply)
          + contact_type      = (known after apply)
          + country_code      = (known after apply)
          + email             = (known after apply)
          + extra_params      = (known after apply)
          + fax               = (known after apply)
          + first_name        = (known after apply)
          + last_name         = (known after apply)
          + organization_name = (known after apply)
          + phone_number      = (known after apply)
          + state             = (known after apply)
          + zip_code          = (known after apply)
        }

      + name_server {
          + name = "ns-351.awsdns-43.com"
        }

      + registrant_contact {
          + address_line_1    = (known after apply)
          + address_line_2    = (known after apply)
          + city              = (known after apply)
          + contact_type      = (known after apply)
          + country_code      = (known after apply)
          + email             = (known after apply)
          + extra_params      = (known after apply)
          + fax               = (known after apply)
          + first_name        = (known after apply)
          + last_name         = (known after apply)
          + organization_name = (known after apply)
          + phone_number      = (known after apply)
          + state             = (known after apply)
          + zip_code          = (known after apply)
        }

      + tech_contact {
          + address_line_1    = (known after apply)
          + address_line_2    = (known after apply)
          + city              = (known after apply)
          + contact_type      = (known after apply)
          + country_code      = (known after apply)
          + email             = (known after apply)
          + extra_params      = (known after apply)
          + fax               = (known after apply)
          + first_name        = (known after apply)
          + last_name         = (known after apply)
          + organization_name = (known after apply)
          + phone_number      = (known after apply)
          + state             = (known after apply)
          + zip_code          = (known after apply)
        }
    }

  # aws_route53domains_registered_domain.philward_io_domain["ns-668.awsdns-19.net"] will be created
  + resource "aws_route53domains_registered_domain" "philward_io_domain" {
      + abuse_contact_email = (known after apply)
      + abuse_contact_phone = (known after apply)
      + admin_privacy       = true
      + auto_renew          = true
      + creation_date       = (known after apply)
      + domain_name         = "philward.io"
      + expiration_date     = (known after apply)
      + id                  = (known after apply)
      + registrant_privacy  = true
      + registrar_name      = (known after apply)
      + registrar_url       = (known after apply)
      + reseller            = (known after apply)
      + status_list         = (known after apply)
      + tags_all            = (known after apply)
      + tech_privacy        = true
      + transfer_lock       = true
      + updated_date        = (known after apply)
      + whois_server        = (known after apply)

      + admin_contact {
          + address_line_1    = (known after apply)
          + address_line_2    = (known after apply)
          + city              = (known after apply)
          + contact_type      = (known after apply)
          + country_code      = (known after apply)
          + email             = (known after apply)
          + extra_params      = (known after apply)
          + fax               = (known after apply)
          + first_name        = (known after apply)
          + last_name         = (known after apply)
          + organization_name = (known after apply)
          + phone_number      = (known after apply)
          + state             = (known after apply)
          + zip_code          = (known after apply)
        }

      + name_server {
          + name = "ns-668.awsdns-19.net"
        }

      + registrant_contact {
          + address_line_1    = (known after apply)
          + address_line_2    = (known after apply)
          + city              = (known after apply)
          + contact_type      = (known after apply)
          + country_code      = (known after apply)
          + email             = (known after apply)
          + extra_params      = (known after apply)
          + fax               = (known after apply)
          + first_name        = (known after apply)
          + last_name         = (known after apply)
          + organization_name = (known after apply)
          + phone_number      = (known after apply)
          + state             = (known after apply)
          + zip_code          = (known after apply)
        }

      + tech_contact {
          + address_line_1    = (known after apply)
          + address_line_2    = (known after apply)
          + city              = (known after apply)
          + contact_type      = (known after apply)
          + country_code      = (known after apply)
          + email             = (known after apply)
          + extra_params      = (known after apply)
          + fax               = (known after apply)
          + first_name        = (known after apply)
          + last_name         = (known after apply)
          + organization_name = (known after apply)
          + phone_number      = (known after apply)
          + state             = (known after apply)
          + zip_code          = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 1 to destroy.


```

</details>

*Pushed by: @phil-ward, Action: `pull_request`*